In [4]:
import pandas as pd

In [5]:
import numpy as np

In [4]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d= {'a':10,'b':20,'c':30}

In [5]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_data,index = labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(d,labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [12]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [13]:
ser1 = pd.Series([1,2,3,4],['w','h','a','t'])

In [14]:
ser1

w    1
h    2
a    3
t    4
dtype: int64

In [15]:
ser2 = pd.Series([1,2,5,4],['w','h','y','t'])

In [16]:
ser2

w    1
h    2
y    5
t    4
dtype: int64

In [17]:
ser1 + ser2

a    NaN
h    4.0
t    8.0
w    2.0
y    NaN
dtype: float64

In [18]:
ser1['a']

3

In [19]:
ser3 = pd.Series(labels)

In [20]:
ser3

0    a
1    b
2    c
dtype: object

In [21]:
ser3[0]

'a'

# Data Frames

In [3]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [7]:
type(df['W'])

pandas.core.series.Series

In [8]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.W #not reccomendable

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [12]:
df[['W','Z']] #for multiple columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [15]:
df['new'] = df['W'] + df['Y'] #adding new col with arithematic of other cols

In [16]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df #even now the col is present after dropping

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [20]:
#so pandas requires inplace arguments to make the operation permanant
df.drop('new',axis=1,inplace=True)

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df.drop('E',axis=0) #for dropping the cols

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [25]:
df.shape  
#we use 0 for rows and 1 for cols because data frame is bascically a numpy arrays with indexes so try using shape you will
#see no of cols and rows in tuple

(5, 4)

In [26]:
df.loc['A'] #to return row A

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [27]:
df.iloc[2] #to pass on index of the location

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [28]:
df.loc['B','Y'] #accessing an element

-0.84807698340363147

In [30]:
df.loc[['A','B'],['W','Y']] #list of cols and rows we want for subset

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [34]:
booldf = df > 0 #to know where the values are greater than zero

In [36]:
df[booldf] #conditional selection using data frame

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [39]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [40]:
df[df['W'] > 0] # we wont get c because c fails the condition

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df[df['Z']<0] #grab all the data where col z < 0

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [42]:
# we can grab subset of the result of selection formula
#get X of the data where W > 0

df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [43]:
#grab x and y where w > 0
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [48]:
# multiple conditions

#df[(df['W']>0) and (df['Y']<1)] will fail because python and operator can do operation on series of boolena values

df[(df['W']>0) & (df['Y']<1)] # only use & for and | for or

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [51]:
df.reset_index() #setting the rows and cols names to index variable

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [52]:
newInd = 'CA NY AL MA NH'.split(' ')

In [53]:
newInd

['CA', 'NY', 'AL', 'MA', 'NH']

In [56]:
df['States'] = newInd #creating new col

In [57]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     AL
D  0.188695 -0.758872 -0.933237  0.955057     MA
E  0.190794  1.978757  2.605967  0.683509     NH

In [58]:
df.set_index('States') #if you want to set index to the column in data

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
AL     -2.018168  0.740122  0.528813 -0.589001
MA      0.188695 -0.758872 -0.933237  0.955057
NH      0.190794  1.978757  2.605967  0.683509

In [7]:
#multi index and data hirearchy

outside = 'G1 G1 G1 G2 G2 G2'.split(' ')
inside=[1,2,3,1,2,3]

In [8]:
hier_index = list(zip(outside,inside)) #just zipping to form tuples
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [9]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [10]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [11]:
df

             A         B
G1 1  2.153950  0.355505
   2  0.197372 -2.359396
   3  1.524468 -0.301962
G2 1 -1.280950  0.856455
   2 -0.112820 -0.481002
   3  0.351227  1.945482

In [13]:
df.loc['G1'].loc[1] #nested indexing

A    2.153950
B    0.355505
Name: 1, dtype: float64

In [14]:
df.index.names = ['groups','num'] #naming indices

In [15]:
df

                   A         B
groups num
G1     1    2.153950  0.355505
       2    0.197372 -2.359396
       3    1.524468 -0.301962
G2     1   -1.280950  0.856455
       2   -0.112820 -0.481002
       3    0.351227  1.945482

In [17]:
df.loc['G2'].loc[2]['B']   #calling a particular element

-0.4810021614682925

In [18]:
df.xs('G1') #indexing can also be done using xs

            A         B
num
1    2.153950  0.355505
2    0.197372 -2.359396
3    1.524468 -0.301962

In [20]:
df.xs(1,level='num')

              A         B
groups
G1      2.15395  0.355505
G2     -1.28095  0.856455

# Missing Data

write into inkspace from here

In [21]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,4]} #np.nan is null in pandas

In [22]:
df = pd.DataFrame(d)

In [23]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  4

In [24]:
df.dropna() #drop all the nan or null value cols

     A    B  C
0  1.0  5.0  1

In [25]:
df.dropna(thresh=2) #threshold is equal to 2 so drop if 2 or more

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [26]:
df.fillna(value='any string') #can substitute any nan column with any thing

            A           B  C
0           1           5  1
1           2  any string  2
2  any string  any string  4

In [27]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  4

In [28]:
df['A'].fillna(value=df['A'].mean()) #usually it is filled with mean of the column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Group by

Group by allows you to group together rows based off of a column and perform an aggregate function on them

In [31]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,100,340,560,243,567]}

In [32]:
df = pd.DataFrame(data)

In [33]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    100
2    MSFT      Amy    340
3    MSFT  Vanessa    560
4      FB     Carl    243
5      FB    Sarah    567

In [35]:
g_comp = df.groupby('Company') #group by company

In [37]:
g_comp.mean() #it ignores any non number columns and performs group by on only numeric cols

         Sales
Company
FB         405
GOOG       150
MSFT       450

In [38]:
g_comp.sum()

         Sales
Company
FB         810
GOOG       300
MSFT       900

In [40]:
df.groupby('Company').sum().loc['FB'] #sum of all the cols of company FB

Sales    810
Name: FB, dtype: int64

In [42]:
df.groupby('Company').max() #max of each company

          Person  Sales
Company
FB         Sarah    567
GOOG         Sam    200
MSFT     Vanessa    560

In [44]:
df.groupby('Company').describe() #gives over all view by group by

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
FB        2.0  405.0  229.102597  243.0  324.0  405.0  486.0  567.0
GOOG      2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0
MSFT      2.0  450.0  155.563492  340.0  395.0  450.0  505.0  560.0

# Merging Joining and Concatenating

In [45]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [46]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [47]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [48]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [49]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [50]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Concatenation is to concatenat ethe dataframes together. One has to make sure of the dimensions of the data frames.

In [51]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [52]:
pd.concat([df1,df2,df3],axis=1) #concat on the cols

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

We get lot of NaN because the data for concatenating doesnt exist in that particular operation

In [53]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

Merging helps in merging two data frames together using a similar logic as merging SQL tables together

In [54]:
pd.merge(left,right,how='inner',on='key') #merge on inner based on key col

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [55]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [56]:
pd.merge(left,right,on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [57]:
pd.merge(left,right,on=['key1','key2'],how='right')

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

Joining is a convinient method for combining the columns of two potentially different-indexed Data Frames into a single result

In [58]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [59]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

# Operations

In [6]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [61]:
df['col2'].unique() #finding unique values in the col of the array

array([444, 555, 666], dtype=int64)

In [62]:
df['col2'].nunique() #finding number of unique values in the col of the array

3

In [63]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [64]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [1]:
def times2(x):
    return x*2;

In [8]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [10]:
df['col3'].apply(lambda x: x*2)  #apply the functions to the column values in dataframes

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [11]:
df.columns  #for the name of the column names

Index(['col1', 'col2', 'col3'], dtype='object')

In [12]:
df.index  #for index range

RangeIndex(start=0, stop=4, step=1)

In [13]:
df.sort_values('col2') #sort it by col2

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [14]:
df.isnull()   #boolean data frame with null or not

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [16]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [17]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [18]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN